app/controllers/items_controller.rb

	def index
		if params[:search]
			search_query = "%" + params[:search].split(' ').join('%') + "%"
			items = Item.where("LOWER(name) LIKE LOWER(?)", search_query)
			items = items.map{|item| {id: item.id, name: item.name, description: item.description,
					price: item.price,state: item.state, img_url: item.img_url,
					user: item.user
					}
			}
		else
			items = Item.where(state: "sell")
---
SELECT "items".* FROM "items" WHERE (LOWER(name) LIKE LOWER('%shirt%'))
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."state" = $1  [["state", "sell"]]

	def update
			begin
				user = User.find(params[:user_id])
				item = Item.find(params[:item_id])
				item.user = user
				item.state = "bought"
				item.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "user_id" = $1, "state" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["user_id", 1], ["state", "bought"], ["updated_at", "2019-10-28 20:22:31.492613"], ["id", 2]]

	def create
		item = Item.create(item_params)
---
INSERT INTO "items" ("name", "description", "state", "img_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["description", ""], ["state", "sell"], ["img_url", ""], ["user_id", 2], ["created_at", "2019-10-28 19:27:19.449165"], ["updated_at", "2019-10-28 19:27:19.449165"]]