app/controllers/users_controller.rb

	def login
		# if the id exists log the user in
		begin
			user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def bought_items
		items = Item.where(user_id: params[:id], state: "bought")
		items = items.map{|item| {id: item.id, name: item.name, description: item.description,
			price: item.price,state: item.state, img_url: item.img_url,
			user_id: item.user.id, user_name: item.user.name
---
SELECT  "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."state" = $2 LIMIT $3  [["user_id", 1], ["state", "bought"], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."state" = $2  [["user_id", 4], ["state", "bought"]]

	def selling_items
		render json: Item.where(user_id: params[:id], state: "sell")
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."state" = $2  [["user_id", 4], ["state", "sell"]]